postgres_metrics/modified_run_e_postgres_threads_256_operations_15585.dat
//bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-III/conf:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/conf:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/postgrenosql-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/checker-qual-3.31.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/mongo-java-driver-3.11.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/postgresql-42.6.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/slf4j-simple-1.7.13.jar site.ycsb.Client -t -db site.ycsb.postgrenosql.PostgreNoSQLDBClient -P ./workloads/workloade -threads 256 -p recordcount=15585 -P ./postgrenosql/conf/postgrenosql.properties
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
[OVERALL], RunTime(ms), 8017
[OVERALL], Throughput(ops/sec), 124.73493825620557
[TOTAL_GCS_G1_Young_Generation], Count, 2
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 21
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.26194337033803167
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 21
[TOTAL_GC_TIME_%], Time(%), 0.26194337033803167
[READ], Operations, 54
[READ], AverageLatency(us), 1599142.7037037036
[READ], MinLatency(us), 2840
[READ], MaxLatency(us), 2334719
[READ], 95thPercentileLatency(us), 2308095
[READ], 99thPercentileLatency(us), 2322431
[READ], Return=OK, 54
[CLEANUP], Operations, 256
[CLEANUP], AverageLatency(us), 12.15234375
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 2747
[CLEANUP], 95thPercentileLatency(us), 3
[CLEANUP], 99thPercentileLatency(us), 3
[SCAN], Operations, 946
[SCAN], AverageLatency(us), 1592612.3615221987
[SCAN], MinLatency(us), 5280
[SCAN], MaxLatency(us), 2330623
[SCAN], 95thPercentileLatency(us), 2303999
[SCAN], 99thPercentileLatency(us), 2316287
[SCAN], Return=OK, 946